Revit 2024 API
BuiltInFailures.GroupFailures.ProblemRegeneratingInGroupUpdate Property
 Unable to regenerate while updating groups at end of transaction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ProblemRegeneratingInGroupUpdate { get; }
Visual Basic
Public Shared ReadOnly Property ProblemRegeneratingInGroupUpdate As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ProblemRegeneratingInGroupUpdate {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace